SSE.getVertexTagsOfEdge(System.Int32,System.Int32(*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)[N2])
returns the tags of the two vertices at the ends of the edge.

SSE.getUnderlyingRefPlane(Pick!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double!System.Runtime.CompilerServices.IsConst*,Plane!System.Runtime.CompilerServices.IsConst*,Plane*,Arr&lt;Atom&gt;*)
returns ERR_NOT_APPLICABLE if it does not apply to the slab shape edit

SSE.hasEditableThickness(System.Double*)
"hasEditableThickness" returns true if the slab type has
a variable layer.

SSE.hasConstantThickness(System.Double*)
"hasConstantThickness" returns true if (a) there is no
variable layer, or (b) all the offsets are the same

SSE.hasConstantOffset(System.Double*)
"hasConstantOffset" is true when all the vertices have the same
offset.  When it returns true the passed in pOffset will be populated
with the common offset/
If this is 'true' we know that the top and bottom are flat
But they may have multiple faces

SSE.transform(Trf!System.Runtime.CompilerServices.IsConst*,Arr&lt;Atom&gt;*)
This method needs to be called from the elements move helper's
transform method.  It is used to inform the slab shape edit step of
the movement of the element

SSE.augmentGRep(DBView!System.Runtime.CompilerServices.IsConst*,GRep**)
"augmentGRep" does two things,
1) adds the GPoints to the model and view specific GReps
2) adds colored GLines to the view specific GRep when in edit mode.

SSE.getDetermRegenSteps(Arr&lt;RegenStep**&gt;*)
The slab shape edit step uses two additional regen steps
to keep track of the underlying slab

SSE.getAtom
Returns the atom for the SlabShapeEditGStep even if it is dormant.
It returns a default constructed atom if the step is not present.

SSE.isMyPick(Pick!System.Runtime.CompilerServices.IsConst*)
check whether "pick" is a handle relevant to "this" GStep

SSE.setOffset(System.Int32,System.Double,System.Boolean)
If the entity is a vertex then the vertex is given the new offset value.
If the entity is an edge then the angle of the edge with the z_direction
is preserved if 'preserveAngle' is true.
If 'preserveAngle' is false both end vertices receive the same offset, and
the edge becomes horizontal

SSE.getEntityInfo(System.Int32,XYZ*,System.Double*,System.Boolean*,System.Boolean*)
- edge offset is the average of offsets of its ends
- for edges "pOffsetsEqual" reports whether ends have the same offset. always true for vertices

SSE.getOriginalFaceHeight
will be used as a z-component for the origin of the horizontal plane for the crease editor's SketchPlane

SSE.isApplicable
There are certain constraints on the slab for it to be eligible for
slab shape editing.  This function returns true if the element
can be slab shape edited

SSE.isStepDormant
Every floor and roof has a SlabShapeEditGStep, but unless the
user edited the slab the step will be dormant.
Also, resetting the edits will return the GStep to be dormant.

SSE.setEditMode(ElementId)
functions to put the element into 'edit' mode

SSE.isEnabled
returns true if the slab shape UI should be enabled in the UI.

SSE.recomputeGRep(Element*)
Used to upgrade the GRep.  Particularly to recompute the GGTags

SSE.recomputeApplicableStatus(Element*)
Used to recompute the applicability of the slab slab edit to
adjust new functionality that allows curved boundaries.

SSE.addSlabShapeEditGStep(Element*,System.Boolean)
'addSlabShapeEditGStep' is used to add the slab shape edit GStep to
the floor and roof elements

SSE
The SSE class provides the interface to access the slab shape edit functionality